# SpotLightDistribution Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpotLightDistribution Constructor
SpotLightDistribution Class See Also
---
Creates a spot light distribution object with the following values;
  * PI/6 radians spot beam angle
  * PI/2 radians spot field angle
  * PI/6 radians tilt angle

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SpotLightDistribution()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SpotLightDistribution()
```

# See Also
SpotLightDistribution Class
SpotLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace